[
    {
        "time": "2025",
        "title": "Lead AI Engineer & Fullstack Developer at UrbaSense - Startup",
        "desc": "AI-driven solution built with a Flutter mobile app and secure web platform for reporting and managing urban anomalies, using a Random Forest model for automatic classification of geolocated reports and featuring a badge system to boost citizen engagement."
    },
        {
        "time": "2025",
        "title": "AI Day USTHB Coach",
        "desc": "Led a workshop on AI-driven oil price forecasting and trading strategies, leveraging a colleague-developed tool for seamless data preprocessing and visualization, and demonstrated real-time production and stock predictions using LSTMs and CNNs for sequential data analysis."
    },
    {
        "time": "2025",
        "title": "Mentor and Conference Speaker at OpenHouse USTHB",
        "desc": "Participated as a mentor and speaker, delivering workshops on Python and PyTorch, and presenting a mini-conference on the mathematical foundations of Neural Networks and Deep Learning. Showcased projects including Human Body Health Indices Estimation using the U2Net_Model, interactive PyTorch demos like MNIST, and AI applications such as Brain Tumor Segmentation Models. Engaged attendees with interactive tools like Body Posture Detection and Body Roundness Index calculator, fostering discussions on health, AI, and accessibility."
    },
    {
        "time": "2025",
        "title": "Workshop Presenter and AI Project Demonstrator at OpenHouse USTHB",
        "desc": "Presented a hands-on workshop on PyTorch, building a digit classifier using the MNIST dataset with live coding and interactive Q&A. Shared slides and GitHub repositories for the MNIST demo and a Body Roundness Index calculator using the U2NET model. Emphasized the importance of user interface design in making AI tools accessible and encouraged cross-disciplinary knowledge sharing among students and researchers in biology, chemistry, and petroleum engineering."
    },
    {
        "time": "2025",
        "title": "Lead AI Engineer & Fullstack Developer at AMIDI - Startup",
        "desc": "Developed a touristic app featuring advanced AI capabilities and large language models (LLMs) for personalized recommendations."
    },
    {
        "time": "2024",
        "title": "Freelance Fullstack Developer at Bassmati - Startup",
        "desc": "Built a healthcare app prototype connecting psychologists, speech therapists, and patients, with features including encrypted medical records storage, appointments management, staff authentication, and payment verification."
    },
    {
        "time": "2023 - Present",
        "title": "Backend Developer at OpenMindsClub & Mentor",
        "desc": "Developed backend infrastructure for event websites and club projects, mentored members through workshops, and participated in hackathons and CTFs to enhance skills and knowledge."
    },
    {
        "time": "2023",
        "title": "Freelance Fullstack Developer at ElRafik - Startup",
        "desc": "Generated $20K revenue in 6 months for a startup app that won a label in 2024, enabling psychology students and professionals to register for internships or training courses and connect with future patients."
    }
]
