[
    {
        "img": "assets/images/proejcts/screen.png",
        "title": "NeuroCareAI",
        "desc": "I developed a fast, optimized AI model with a unique architecture that accurately segments 3D brain tumors from low-quality 2D MRI scans, even with missing sequences, achieving 93% precision validated by real patient data and expert medical feedback. I built a complete ecosystem around it, including a robust API, a WebGL-based web app for 3D visualization and job management, and a desktop app with advanced features. I’m preparing to outsource the full codebase and documentation to enable wider access, collaboration, and integration into clinical workflows to improve diagnostics and patient outcomes."
    },
    {
        "img": "https://github.com/zaqks/U2Net_BodyMeasurement/raw/main/out/test_lines.jpg",
        "title": "U2Net BodyMeasurment",
        "desc": "Human Body Measurement from Image using AI.",
        "url": "https://github.com/zaqks/QuakeGuard"
    },
    {
        "img": "https://github.com/zaqks/miniDEL/raw/main/docs/screen.png",
        "title": "MiniDEL Pseudo Compiler",
        "desc": "Pseudo-language compiler (lexer/parser/semantic analyzer) built with Lex, Bison, and C (binaries only), with integrated editor.",
        "url": "https://github.com/zaqks/QuakeGuard"
    },
    {
        "img": "assets/images/projects/quake.png",
        "title": "QuakeGuard",
        "desc": "This is an API that allows EarthQuake detection using an Arduino Vibration Sensor Or Dedicated Hardware (Prototyping using Wifi and Bluetooth)",
        "url": "https://github.com/zaqks/QuakeGuard"
    },
    {
        "img": "assets/images/projects/mlz.svg",
        "title": "Machine Learning Library (MLZ)",
        "desc": "A machine learning library built from scratch using Numpy. It provides an environment for developing custom layers and activation methods, supporting classical NNs and CNNs while expanding for additional tools."
    },
    {
        "img": "https://github.com/zaqks/WhisperKeys/raw/main/docs/screen.png",
        "title": "WhisperKeys",
        "desc": "Mechanical keyboards sound replicator."
    },
    {
        "img": "assets/images/projects/majesty.png",
        "title": "MAJESTY",
        "desc": "An e-commerce API featuring 3D product previews generated from multi-angle images processed with photogrammetry algorithms. Includes shop and order management systems with statistics."
    },
    {
        "img": "assets/images/projects/chat.png",
        "title": "Encrypted Chat System",
        "desc": "An encrypted chat system with integrated VPN and proxy and customizable UI features. Includes API integration."
    },
    {
        "img": "assets/images/projects/sdl_raycast.png",
        "title": "SDL Raycaster",
        "desc": "A basic raycaster implemented using the SDL library based on techniques from the DOOM game. It renders maps defined by a 2D array.",
        "url": "https://github.com/zaqks/SDL_RAYCASTER"
    }
]
