[
    {
        "title": "Mobile Development",
        "desc": "Build fast, modern apps for iOS & Android using Flutter and Dart for seamless cross-platform experiences."
    },
    {
        "title": "Web Development",
        "desc": "Create responsive, robust websites and web apps with Django, MERN, FastAPI, Flask, and Flet."
    },
    {
        "title": "Frontend Development",
        "desc": "Craft stunning, interactive user interfaces using React, Flutter, and PyQt for web and desktop."
    },
    {
        "title": "Backend Development",
        "desc": "Develop secure, scalable server solutions with Django, Node.js, Spring Boot, FastAPI, and Flask, plus SQL, MariaDB, and MongoDB databases."
    },
    {
        "title": "Fullstack Development",
        "desc": "Deliver complete end-to-end app solutions integrating frontend and backend with MERN, Django, and Flutter."
    },
    {
        "title": "SaaS, PaaS, IaaS Development",
        "desc": "Build scalable cloud platforms tailored to your business needs."
    },
    {
        "title": "IoT Development",
        "desc": "Design smart, connected device solutions with real-time data processing."
    },
    {
        "title": "Software Development",
        "desc": "Develop custom desktop and enterprise software using Python, C, C++, Java, and Qt."
    },
    {
        "title": "AI Model Design & Development",
        "desc": "Create smarter applications with AI models designed, trained, and deployed using PyTorch, TensorFlow, Keras, and Kaggle."
    },
    {
        "title": "AI Research",
        "desc": "Conduct cutting-edge AI innovation and advanced machine learning research."
    },
    {
        "title": "Data Analytics",
        "desc": "Transform data into actionable insights with expert analysis and visualization."
    },
    {
        "title": "Visual Computing",
        "desc": "Deliver advanced 3D graphics and visualization solutions using VTK and PyQt."
    },
    {
        "title": "UI/UX Design",
        "desc": "Design intuitive, engaging user experiences for web, mobile, and desktop platforms."
    },
    {
        "title": "Logo & Brand Design",
        "desc": "Develop memorable logos and branding to make your business stand out."
    },
    {
        "title": "Solution Design",
        "desc": "Provide tailored, robust, and scalable technology solutions."
    },
    {
        "title": "System Design",
        "desc": "Build reliable and efficient end-to-end system architectures."
    },
    {
        "title": "Infrastructure & Ecosystem Development",
        "desc": "Create solid IT infrastructures and optimize digital ecosystems."
    },
    {
        "title": "Compiler Development",
        "desc": "Develop custom compilers and interpreters for specialized programming needs."
    }
]